#include <iostream>

using namespace std;

main(){

     //2. Доорх кодыг туршиж үр дүнг тайлабарлан бич.
    char *p1 = ; // char төрлийн хаяган хувьсагч зарласан.
    int *p2; // int төрлийн хаяган хувьсагч зарласан.
    double *p3; // double төрлийн хаяган хувьсагч зарласан
    cout<<sizeof(p1)<<sizeof(p2)<<sizeof(p3);// дээр зарласан 3н төрлийн хаяган хувьсагчийн санах
    //ойд эзлэх хэмжээг хэвлэж байна.
    //Бүгд ижилхэн 8 byte гэж гарсан. Учир нь тухайн хувьсагчууд нь бүгд хаяган хувьсагч тул
    //ямар нэг хувьсагчийн хаягийг хадгал бөгөөд төрөл нь зөвхөн тухайн хаяган хувьсагчийн ямар
    //төрлийн хувьсагчийн хаягийг хадгалахыг зааж өгдөг. Иймд тухайн хувьсагчид хадгалах хаяг нь
    //8 byte - ийн хэмжээтэй тоон утга байна.

    return 0;
}
