#include <iostream>
using namespace std;

int main(){

    //3. Доорх кодыг туршиж мөр бүрийн үр дүнг тайлбарлан бич.
    int a=125;// int төрлийн гарааны утга нь 125 байх, a гэх хувьсагч зарласан
    int *p = &a; //int төрлийн p хаяган хувьсагч зарлаж, түүнд a хувьсагчийн хаягийг & операторын тусламжтайгаар
    //гарааны утга болгон олгосон
    cout<<p; //p хувьсагчийн утгыг буюу а хувьсагчийн хаягийг хэвлэсэн.
    cout<<*p; //p хувьсагчид хадгалагдах хаяг дээрх утгыг буюу a хувьсагчийн утгыг хэвлэсэн.
    p++; // p хувьсагчийн утгыг буюу а хувьсагчий хаягийг 4 byte/int/ - аар нэмэгдүүлсэн.
    cout<<p; // p хувьсагчийн утгыг буюу &a + 4 хэвлэсэн.
    cout<<*p; // p хувьсагчид хадгалагдах хаяг дээрх утгыг буюу &a + 4 хаяг дээр утгыг хэвлэсэн

    return 0;
}
