#include <iostream>

using namespace std;

int main(){
    //4. Доорх кодын мөр бүрийг тайлбарла.
    int numbers[5]; //numbers нэртэй int төрлийн 5 урттай хүснэгт зарласан.
    int * p; //бүхэл тоо төрлийн хаяган хувьсагч зарласан.
    p = numbers; //p хаяган хувьсагчид numbers хүснэгтийн хамгийн эхний элементийн хаягийг олгосон. Хүснэгтий элементүүдийн
    // хаяг нь санах ойд дарааллан байрлах бөгөөд int төрлийн хувьсагч тул хаяг нь 4, 4н байтын зайтай. Иймд эхний элементийн
    // хаягаар бүх элементэд хандах боломжтой.
    *p = 10; //p хувьсагчид хадгалагдах хаяг дээрх утгыг буюу numbers хүснэгтийн эхний элементийн утгыг 10 болгосон.
    p++; //p хувьсагчийн утга буюу numbers хүснэгтийн хамгийн эхний элементийн хаягийг 4 byte/int/ - аар нэмэгдүүлнэ. Иймд p
    //хаяган хувьсагч нь numbers хүснэгтийн дараагийн элементийн хаягийг заана. Ө.х numbers[1]  - ийн хаягийг заана.
    *p = 20; //p - д numbers[1] хаяг хадгалагдах тул numbers[1] = 20 болно.
    p = &numbers[2]; // p - д шууд & оператор ашиглан numbers[2] - ны хаягийг олгож байна.
    *p = 30; //p-д numbers[2] хаяг хадгалагдах тул numbers[2] = 30 болно
    p = numbers + 3;//numbers нь numbers хүснэгтийн хамгийн эхний элементийн хаягийг хадгалах тухайн хаягийг 3 - аар
    // нэмэгдүүлж p хадгалснаар p - д numbers[3] хаяг хадгалагдах юм. Учир 1 int -> 4 byte, 3 int -> 12 byte болох юм.
    *p = 40;//p - д numbers[1] хаяг хадгалагдах тул numbers[3] = 40 болно.
    p = numbers; // p - д numbers хүснэгтийн хамгийн эхний элементийн хаяг олгогдоно.
    *(p+4) = 50; // p - д numbers[0] хаяг байх бөгөөд p + 4 нь numbers[4] хаяг болно. Мөн * оператороор numbers[4]
    // утгыг 50 болгосон.
    for (int n=0; n<5; n++)//int n нь [0, 4] гүйх for давталт үүсгэсэн
        cout << numbers[n] << ", ";//давталтын бие дотор numbers[n] - ийг буюу numbers хүснэгтийн бүх
        //элементийг хэвлэж байна.
        //result: 10, 20, 30, 40, 50,
    return 0;
}
